Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.rds.aws_db_parameter_group.rds has been changed
~ resource "aws_db_parameter_group" "rds" {
        id          = "mysql-comentarios-api-production-20210809044714452300000001"
        name        = "mysql-comentarios-api-production-20210809044714452300000001"
      + tags        = {}
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }
  # module.rds.aws_db_subnet_group.rds has been changed
~ resource "aws_db_subnet_group" "rds" {
        id          = "comentarios-api-production-rds"
        name        = "comentarios-api-production-rds"
      + tags        = {}
        # (4 unchanged attributes hidden)
    }
  # aws_internet_gateway.gw has been changed
~ resource "aws_internet_gateway" "gw" {
        id       = "igw-09572d2a3006b75cb"
      + tags     = {}
        # (4 unchanged attributes hidden)
    }
  # aws_subnet.az-a has been changed
~ resource "aws_subnet" "az-a" {
        id                              = "subnet-0a128096a921e27ba"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }
  # aws_subnet.az-b has been changed
~ resource "aws_subnet" "az-b" {
        id                              = "subnet-08610eec2f5291688"
      + tags                            = {}
        # (10 unchanged attributes hidden)
    }
  # aws_api_gateway_method.get has been changed
~ resource "aws_api_gateway_method" "get" {
      + authorization_scopes = []
        id                   = "agm-n1fiynim17-eqioip-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }
  # aws_iam_role.iam_for_lambda has been changed
~ resource "aws_iam_role" "iam_for_lambda" {
        id                    = "iam_for_lambda"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole",
        ]
        name                  = "iam_for_lambda"
      + tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_s3_bucket.main has been changed
~ resource "aws_s3_bucket" "main" {
        id                          = "s3-comentarios-api"
      + tags                        = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_security_group.main has been changed
~ resource "aws_security_group" "main" {
        id                     = "sg-09b0faa61bf615a6f"
        name                   = "vpc_security_group"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }
  # aws_api_gateway_rest_api.api has been changed
~ resource "aws_api_gateway_rest_api" "api" {
        id                           = "n1fiynim17"
        name                         = "api"
      + tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # aws_vpc.main has been changed
~ resource "aws_vpc" "main" {
        id                               = "vpc-0c776cafe58b4328b"
      + tags                             = {}
        # (13 unchanged attributes hidden)
    }
  # aws_security_group.lambda-sg has been changed
~ resource "aws_security_group" "lambda-sg" {
        id                     = "sg-0b8d7fbd67590ac85"
        name                   = "lambda-sg"
      + tags                   = {}
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_api_gateway_integration.integration will be created
+ resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "eqioip"
      + rest_api_id             = "n1fiynim17"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_lambda_function.main will be created
+ resource "aws_lambda_function" "main" {
      + arn                            = (known after apply)
      + function_name                  = "comentarios-api"
      + handler                        = "main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::107815129133:role/iam_for_lambda"
      + runtime                        = "python3.8"
      + s3_bucket                      = "comentarios-api"
      + s3_key                         = "api.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0b8d7fbd67590ac85",
            ]
          + subnet_ids         = [
              + "subnet-08610eec2f5291688",
              + "subnet-0a128096a921e27ba",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.apigw_lambda will be created
+ resource "aws_lambda_permission" "apigw_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "comentarios-api"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:us-east-2:107815129133:n1fiynim17/*"
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.rds.aws_db_instance.rds will be created
+ resource "aws_db_instance" "rds" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 14
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "comentarios-api-production-rds"
      + delete_automated_backups              = true
      + enabled_cloudwatch_logs_exports       = [
          + "audit",
          + "error",
          + "slowquery",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7.19"
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "comentarios-api-production-rds01"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.small"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "mysql-comentarios-api-production-20210809044714452300000001"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Environment" = "production"
          + "Name"        = "comentarios-api-production-rds01"
          + "Project"     = "comentarios-api"
        }
      + tags_all                              = {
          + "Environment" = "production"
          + "Name"        = "comentarios-api-production-rds01"
          + "Project"     = "comentarios-api"
        }
      + timezone                              = (known after apply)
      + username                              = (sensitive)
      + vpc_security_group_ids                = [
          + "sg-014ac24e2e3545e4e",
        ]
    }

  # module.rds.aws_security_group_rule.rds_sg_in[0] will be created
+ resource "aws_security_group_rule" "rds_sg_in" {
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-014ac24e2e3545e4e"
      + self                     = false
      + source_security_group_id = "sg-0b8d7fbd67590ac85"
      + to_port                  = 3306
      + type                     = "ingress"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.weploy.com.br/lock?id=alsofer%252Fcomentarios-api-infra%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 5 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
